Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.LoadsMayBeNotUpToDate Property
 Reactions defined as Internal Load (Is Reaction) may no longer be valid since the analytical model has changed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LoadsMayBeNotUpToDate { get; }
Public Shared ReadOnly Property LoadsMayBeNotUpToDate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LoadsMayBeNotUpToDate {
	FailureDefinitionId^ get ();
}
static member LoadsMayBeNotUpToDate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace